Revit 2027 API
StructuralSettings.BraceParallelLineOffset Property
 The distance by which brace symbols in plan views will be offset.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BraceParallelLineOffset { get; set; }
Public Property BraceParallelLineOffset As Double
	Get
	Set
public:
property double BraceParallelLineOffset {
	double get ();
	void set (double value);
}
member BraceParallelLineOffset : float with get, set
Property Value
Double
Remarks
 Applies only when BracePlanRepresentation is set to ParallelLine.
See Also
Reference
StructuralSettings Class
Autodesk.Revit.DB.Structure Namespace